/****************************************************************************************************
 * \file:       FW_InitKit
 * \brief:      Archivo con las funciones de inicializacion del PIC18F4550
 * \author:     Nicolás Ferragamo ferragamo.nico@est.frbautn.edu.ar
 * \date:       22 de abril de 2019
 * \version:    1.0.0
 ****************************************************************************************************/
 
/****************************************************************************************************
 *** INCLUDES
****************************************************************************************************/

#include <xc.h>
#include "FW_InitKit.h"

/****************************************************************************************************
 *** DEFINES PRIVADOS AL MODULO
****************************************************************************************************/

/****************************************************************************************************
 *** MACROS PRIVADAS AL MODULO
****************************************************************************************************/

/****************************************************************************************************
 *** TIPOS DE DATOS PRIVADOS AL MODUL
****************************************************************************************************/

/****************************************************************************************************
 *** TABLAS PRIVADAS AL MODULO
****************************************************************************************************/

/****************************************************************************************************
 *** VARIABLES GLOBALES PUBLICAS
****************************************************************************************************/

/****************************************************************************************************
 *** VARIABLES GLOBALES PRIVADAS AL MODULO
****************************************************************************************************/

/****************************************************************************************************
 *** PROTOTIPO DE FUNCIONES PRIVADAS AL MODULO
****************************************************************************************************/

/****************************************************************************************************
 *** FUNCIONES PRIVADAS AL MODULO
****************************************************************************************************/

/****************************************************************************************************
 *** FUNCIONES GLOBALES AL MODULO
****************************************************************************************************/

/**
 *	\fn         void Kit_Init(void)
 *	\brief      Inicializa el entrenador
 *  \details    Inicializa todos los puertos del entrenador preparandolo para usar
 *              el display y deshabilitando los comparadores de entrada y los
 *              canales analógicos. También limpia todas las salidas.
 *	\author     Esteban Lemos
 *	\date 
 *  \param      [in]  void 
 *  \param      [out] void 
 *	\return           void
*/
void Kit_Init(void){
    
    //Borrado de todos los puertos
    LATA = 0x00;
    LATB = 0x00;
    LATC = 0x00;
    LATD = 0x00;
    LATE = 0x00;

    //LEDS y pulsadores

    TRISD         = 0xF0;   // RD0 a RD3 salidas RD4 a RD7 entradas
    TRISCbits.RC6 = 0;      // RC6 y RC7 salidas
    TRISCbits.RC7 = 0;

    //Display

    CMCON  = 0x07;          // comparadores de entrada deshabilitados
    ADCON1 = 0x0F;          // Conversores AD deshabilitados
    TRISA  = 0xC0;          // RA1 a RA5 salidas
    TRISE  = 0x00;          // RE0 a RE2 salidas el resto no está implementado

    //Puerto B

    TRISB  = 0xFF;          // todas entradas, de ser necesario será configuradas por
                            // el alumno según el mismo necesite
}

